Revit 2024 API
ExporterIFC.SetCurrentExportedDocument Method
 Sets the exporter to process a particular document during export.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023.1
Syntax
C#
public void SetCurrentExportedDocument(
	Document pDocument
)
Visual Basic
Public Sub SetCurrentExportedDocument ( _
	pDocument As Document _
)
Visual C++
public:
void SetCurrentExportedDocument(
	Document^ pDocument
)
Parameters
pDocument
Type: Autodesk.Revit.DB.Document
 The document being processed.
Remarks
 This is intended for use in federated export.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace